# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + MS-Block (Multi-Scale Block) - 深度集成版本
# 论文: YOLO-MS: Rethinking Multi-Scale Representation Learning for Real-Time Object Detection
# 在Backbone和Head中都使用MSBlock替换C3k2

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: 使用MSBlock替换P3、P4层的C3k2
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, MSBlock, [512, 1, True]]    # 6-MSBlock (替换C3k2)
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# Head: 使用MSBlock替换部分C3k2
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 2, MSBlock, [512, 1, False]]   # 13-MSBlock (替换C3k2)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 2, MSBlock, [256, 1, False]]   # 16-MSBlock (替换C3k2)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]          # cat head P4
  - [-1, 2, MSBlock, [512, 1, False]]   # 19-MSBlock (替换C3k2)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]          # cat head P5
  - [-1, 2, C3k2, [1024, True]]         # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]     # Detect(P3, P4, P5)
