# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# 基于原版 yolo11.yaml，在 Layer 10 (C2PSA) 后插入 SE 注意力模块
# 参考: ultralytics/cfg/models/11/yolo11.yaml

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: Layer 0-10 不变，Layer 11 插入 SE
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10
  - [-1, 1, SE, [16]]                    # 11-SE (新增，深层)

# Head: Layer 0-10 不变，Head 起始索引 +1
# Backbone 引用 [-1, 6] 和 [-1, 4] 不变（Layer 0-10 未改变）
# Head 内部引用 +1
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # 不变：Layer 6 = C3k2 [512, True]
  - [-1, 2, C3k2, [512, False]]         # 13 (原12)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # 不变：Layer 4 = C3k2 [512, False, 0.25]
  - [-1, 2, C3k2, [256, False]]         # 16 (原15)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]          # 原13→14 (Head层+1)
  - [-1, 2, C3k2, [512, False]]         # 19 (原18)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]          # 不变：Layer 10 = C2PSA [1024]
  - [-1, 2, C3k2, [1024, True]]         # 22 (原21)

  - [[17, 20, 23], 1, Detect, [nc]]     # 原[16,19,22]→[17,20,23] (Head层+1)
