# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# 基于原版 yolo11.yaml，在 Layer 6 (C3k2) 后插入 SE 注意力模块
# 参考: ultralytics/cfg/models/11/yolo11.yaml

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: 在原版基础上，Layer 6 后插入 SE
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, SE, [16]]                    # 7-SE (新增)
  - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32 (原Layer7)
  - [-1, 2, C3k2, [1024, True]]         # 9 (原Layer8)
  - [-1, 1, SPPF, [1024, 5]]            # 10 (原Layer9)
  - [-1, 2, C2PSA, [1024]]              # 11 (原Layer10)

# Head: 所有索引 +1 (因为Head从11变成12)
# 原版 [-1, 6] → [-1, 6] (Layer6不变，仍是C3k2)
# 原版 [-1, 4] → [-1, 4] (Layer4不变)
# 原版 [-1, 13] → [-1, 14] (Head层+1)
# 原版 [-1, 10] → [-1, 11] (原Layer10→Layer11)
# 原版 [16,19,22] → [17,20,23] (Head层+1)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4 (Layer6不变)
  - [-1, 2, C3k2, [512, False]]         # 14 (原13)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3 (Layer4不变)
  - [-1, 2, C3k2, [256, False]]         # 17 (原16)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]          # cat head P4 (原13→14)
  - [-1, 2, C3k2, [512, False]]         # 20 (原19)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]          # cat head P5 (原10→11)
  - [-1, 2, C3k2, [1024, True]]         # 23 (原22)

  - [[17, 20, 23], 1, Detect, [nc]]     # Detect(P3, P4, P5) (原[16,19,22])
