# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + SE注意力模块 (位置: Layer 1 - 浅层特征增强)
# SE模块插入在第1层Conv后，用于增强浅层特征的通道选择能力

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 1, SE, [16]]                    # 2-SE (浅层)
  - [-1, 2, C3k2, [256, False, 0.25]]   # 3
  - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 5
  - [-1, 1, Conv, [512, 3, 2]]          # 6-P4/16
  - [-1, 2, C3k2, [512, True]]          # 7
  - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 9
  - [-1, 1, SPPF, [1024, 5]]            # 10
  - [-1, 2, C2PSA, [1024]]              # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[17, 20, 23], 1, Detect, [nc]]
